tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"

brew "ag"
brew "ctags"
brew "fasd"
brew "mas"
brew "reattach-to-user-namespace"
brew "s3cmd"
brew "shellcheck"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "zsh"

# Common
# cask "dropbox"
cask "1password"
cask "evernote"
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "microsoft-office"
cask "slack"
cask "spectacle"
cask "spotify"
# mas "1Password", id: 443987910
# mas "Evernote", id: 406056744
mas "LINE", id: 539883307
# mas "Slack", id: 803453959

# Development
cask "jetbrains-toolbox"
# cask "phpstorm"
cask "sequel-pro"
cask "slack"
cask "vagrant"
cask "virtualbox"
# mas "Xcode", id: 497799835

# Driver
cask "kensington-trackball-works"
cask "uhk-agent"
