tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"

brew "ag"
brew "ctags"
brew "fasd"
brew "mas"
brew "nodebrew"
brew "python"
brew "prettier"
brew "reattach-to-user-namespace"
brew "s3cmd"
brew "shellcheck"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tig"
brew "zsh"

# Common
# cask "dropbox"
cask "1password"
cask "deepl"
cask "evernote"
cask "firefox"
cask "google-chrome"
# cask "google-chrome-canary"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "libreoffice"
cask "microsoft-office"
cask "notion"
cask "obsidian"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
cask "vagrant"
cask "virtualbox"
cask "zoomus"
mas "LINE", id: 539883307

# Development
cask "adobe-creative-cloud"
cask "android-studio"
cask "docker"
cask "dotnet-sdk"
cask "jetbrains-toolbox"
cask "intellij-idea"
cask "sequel-pro"
cast "sfdx"
cask "sf-symbols"
cask "slack"
cask "vagrant"
cask "virtualbox"
# mas "Xcode", id: 497799835

# Driver
cask "kensington-trackball-works"
cask "uhk-agent"
